//Код находит сумму элементов с нечетными индексами 
//в одномерном массиве целых чисел и выводит результат на экран.

// Для метода  SumOddElements, который принимает массив целых чисел
// и возвращает сумму элементов с нечетными индексами в массиве.

        // int sum = 0;
        // for (int i = 1; i < array.Length; i = i + 2)
        // {
        //     sum += array[i];
        // }
        // return sum;
    
// Для метода  PrintArray, который выводит элементы массива на экран.

    //  for (int i = 0; i < array.Length; i++)
    //   {
    //     Console.Write(array[i]);
    //     if (i < array.Length - 1) // Проверяем, не последний ли элемент
    //     {
    //     Console.Write("\t"); // Добавляем табуляцию после всех элементов, кроме последнего
    //     }
    //   }
    //     Console.WriteLine();
